bench/results/20260917T203432Z-cursor-scaled20/raw/light/http/bun/round3/c200.wrk.txt
Running 30s test @ http://127.0.0.1:18300/
  1 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.66ms    1.45ms  35.35ms   85.90%
    Req/Sec    38.30k     2.77k   43.46k    72.58%
  Latency Distribution
     50%    1.30ms
     75%    2.10ms
     90%    3.46ms
     99%    4.65ms
  1145773 requests in 30.06s, 311.42MB read
Requests/sec:  38117.40
Transfer/sec:     10.36MB